## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/e5480863-0159-4785-85b2-9903363d8a12).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpswipo14j/plan`

```diff
2024-12-02T19:37:45.489Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T19:37:45.489Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T19:37:45.489Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T19:37:45.489Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T19:37:45.489Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T19:37:45.489Z [INFO]  Go runtime version: go1.21.11
2024-12-02T19:37:45.489Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmpswipo14j/plan"}
2024-12-02T19:37:45.489Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T19:37:45.489Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T19:37:45.489Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T19:37:45.489Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T19:37:45.489Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T19:37:45.490Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T19:37:45.490Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T19:37:45.490Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T19:37:45.490Z [INFO]  CLI command args: []string{"show", "/tmp/tmpswipo14j/plan"}
2024-12-02T19:37:45.583Z [DEBUG] checking for provisioner in "."
2024-12-02T19:37:45.583Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T19:37:45.583Z [DEBUG] created provider logger: level=debug
2024-12-02T19:37:45.583Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T19:37:45.596Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T19:37:45.597Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=307
2024-12-02T19:37:45.597Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T19:37:45.608Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T19:37:45.608Z
2024-12-02T19:37:45.622Z [DEBUG] provider: using plugin: version=6
2024-12-02T19:37:45.622Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin1567694298 network=unix timestamp=2024-12-02T19:37:45.622Z
2024-12-02T19:37:45.658Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T19:37:45.660Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=307
2024-12-02T19:37:45.660Z [DEBUG] provider: plugin exited
2024-12-02T19:37:45.660Z [DEBUG] created provider logger: level=debug
2024-12-02T19:37:45.660Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T19:37:45.666Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T19:37:45.666Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=316
2024-12-02T19:37:45.666Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T19:37:45.669Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T19:37:45.669Z
2024-12-02T19:37:45.684Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin3321908893 network=unix timestamp=2024-12-02T19:37:45.684Z
2024-12-02T19:37:45.684Z [DEBUG] provider: using plugin: version=5
2024-12-02T19:37:45.695Z [DEBUG] No provider meta schema returned
2024-12-02T19:37:45.695Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T19:37:45.696Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=316
2024-12-02T19:37:45.696Z [DEBUG] provider: plugin exited
2024-12-02T19:37:45.696Z [DEBUG] created provider logger: level=debug
2024-12-02T19:37:45.696Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T19:37:45.701Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T19:37:45.702Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=324
2024-12-02T19:37:45.702Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T19:37:45.749Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T19:37:45.749Z
2024-12-02T19:37:45.768Z [DEBUG] provider: using plugin: version=5
2024-12-02T19:37:45.768Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin1041701055 network=unix timestamp=2024-12-02T19:37:45.768Z
2024-12-02T19:37:45.787Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T19:37:45.951Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x9cV{lչ\xbfk\xef\xc6'~d\xbf\xf8\xf9ű\xe3\xc9\xf1k\xbd\xb1g\xbc\xc7v^\x90\x90Ą$\xee\xf9Nf\x8fף\xccάffט\xbf\xfc\xe2r+\xb5\xa5\xa9PU\xa9T\xd2*m(\x88D\xd4R5\xa8<Z\x94\x87 MQ\x8b*@$\x95\xa8Ι}\xd9Y;$\x9c\xdd\xf9\xbd\xbe\xf3\x9d\xfd\xffx\xe1\xc2'.\xbey?ֆI\xaajäo\xfe\xfd\xc2\xf4\x9d\xf2\xe3\xff.\x9cx'L\x81\x84\xf0\xfc\x83/T\xd3	\xc1۫ '$\x8c(\xabh+\xa9\xc2\xd3ϽXMä
2024-12-02T19:37:45.951Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \!\xd5\xf0yH2\xaa\xa0k'\xa4V\xe3j\xa5\x96\xa9Ư\xf8\xa2\xf0	\xc3\xab$+uX'\xb10\xde\xfa\x9c\xc0"\xf0ݐ\xc4"P\x8f\xf5J\xc1\xd3\xff|U`\xabශn\xac\xc15J\x94\xb6\x92U\xf8\xd8\xc5WE~4\xd3!\xf0\xb3\x80Q\x80\xa0\xac\x8dB\xa0\x95(R\x83\xc7?\x95>\xab\xe1\xafk54a\x93\xc4\xfe\xea'\x88\x8cZx7Xc-4c\xb3\xd2B\x81\xac\xc6S\x97>X\x9c\xad\x97\xb5\xd5A+\xb6*-4Jj\xf1\xc4\xc7#4L\xea!!\xa1zh\xc36)\x90:|\xfaԏ#4B\xe0d\xd7 \xebp\x9d\xd2N\x81\xd4\xe3\xef}\`k\xe0\xc9 [\xebq\xbd\xd2A\x814\xe0\x93ϞX~\xb4"
2024-12-02T19:37:45.951Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x9dةl\xa0Q\xb2?yJ\xc4\xe4d@vI(\x8a\x9c\xf8\xb8\x81\x86\xc9Zh\x94\xd0ZPPQ6R \x80'_\xfdF\x8d\x90F\xb886E\xaat7\xae\x83\x88]\xae\x85PUu8\xb2\xaa\x86\xac\xae\xad\xaboX
2024-12-02T19:37:45.951Z [DEBUG] provider.terraform-provider-akash_v0.1.1: d-\xfe\xfa\xa1\xfc\xbe\xff\x81m%\x8dx\xdf\xe9E\xb7\xbb\xfdVBH\xfe\xbb\xb0\xb3?\xad\x82\x8d\x92f\xfc\xd1+\xeffde5MЃ=J/m%-\xf8\xec\x97\xd4\xdd4BZୠ\xcdЇ}Jo\x9c\x90\xe8\xc7~%F\x81\xb4\xe2\xff\xf6\xb9h}+<\xb0Za $ֆ\x97\xfd}\xb2
2024-12-02T19:37:45.951Z [DEBUG] provider.terraform-provider-akash_v0.1.1: B\x8d\xad\x85\xb54\xacml
2024-12-02T19:37:45.951Z [DEBUG] provider.terraform-provider-akash_v0.1.1: 7\xb7\xb4\xb6\x82\xf8\xb5\xf3\xbf.!x]\x94\xd7J\xd6\xe1k\xcf.Z\xc8\xc5`!\xed\xf8\x83\xf9}\0\xa3d=\xbe~邨\xb6:\xe5B\xda \x8eqeҁ\xf7\xbd\xf1\x99\xb0E8\xcc\xc2 *C4J:\xf1\x89\xd7>\xb2up\xb3\x94\xadU	m\xc0\x9f?\xf6\x89\x80\xdaa\xb3\x84\xdaACM\xa6@\xba\xf0\x8f\xcf$\xd7é:\x89\xad\x87&F;\x89\x82\xdf9\xfe~\x98FH\\xae\xa5\xd2	ki\x98l đ\xec\x80QX\x9c\x90N\xc5Q\xf9i\x8cᘲ\x99وO\x9f\xb9$\xc4]\xf0`0]\xb0\xb7([)\x8aϼ\xf3\x90\x987.\xcbP`nS\xb6S \xdd\xf8\xc4_$\xb6^
2024-12-02T19:37:45.951Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xb0\x8dp^'\xb1<\xfb\xb2\xc4ha\xf9\xae\xc7\xeb\x95\xed\x8d텝X\x8b\xeb\xda\xc5T\xad\xef\xe8\xdcХl\xa4\xdd=H/\x9e;{^\xd4\xd2\xdfj\xe9\x86\xb8C\xd9I\xa3\xa4\xcf\xfe\xe6|\x98\x86I\xdc)\xd7\xdf7\xe0\xcaN\xdaB\xfa\xf1\xe4KP/\xa0a\xd2\x9a$\xf4\xc2.ܥ\xec\x8c\xd2\xbbq\xb7\xb2\x87\x89\xe1\xdf.\xfeA$\xf4ÇAB?\x8c\xe3\xb8r#\x8d\x92|\xe8ei\x83C\xd2 {q\xaf\xb2\x87FI?	\xfa`\xab\xe2M\xf8\xads\x92; 1\xc9\x80\x9b\xf0&1\x88\xcf=sFD\xc4\xe1\xe1 "\xfbp\x9f\xb2\x9fF\xc9>\xf5\xd4Q\xe9&\xb8W\xca6\xc1< !Ͼ\xf2\x9e\x80\xf3\x8e\x83p3ެ\xa4-DÏ\xde\xfdB@C\xd0F\xc3D\x85!\xa9\x82[\xf0\xe5`\x9c&pB\xb9\x95\xc6G\xdf\xfc\x9e\xd81\xfe\x96,\xe1!e\x92I\xe0\xcb>,\xb0a8I$6\xb7\xe1mr\xc7~\xfb\xb4\xc4\xf0\xcbZ\x89%\xe00\x96\xd8>}\xee\xfbB\xc7\xe0\xbd\xe0\x92c0\x85S\xc5\xcf\xfe%wz\x8e\xd7H\xdd\xc1#\xca\xf6Ǝ\xc2N7\xf5\xf6\xf5\xc7ⱁ\xf8\xa6\xc1!UN\xb0\x91\xd1v !XXX\xa837\xc4n\xdfjo&U\xb0\xf0\xc8\xf3\x97\xdf\xf9\xa0ޖ\xff\xc6\xeeho'Ղw\xf9\xf1_)|\x8c\xfd7\xfb/V\xe3\xe9\xe9\x8c\xc5=1\x9c\xac\xed\xb3j#\x93eu\xb6n;7;\xe9\xb1^Ý\xcf\xf8\x8e\xc6-\xcb\xcc\xf8\xa6\xa1\x99\xb6\xcf][\xb7\xb4S\xf7\xd5\xccKLd-6h\xacD\xd32c,1-\x9bGՔÆ\x8d\x95\xd8j,>9\xc6{-\x9e\xe6\xb6?\xa0
2024-12-02T19:37:45.953Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xff\x95ː\xfe\xc2xdYc\xdb\xf4|n\xe4\xad'S\xdf\xe8d\x8fZ\x9c\xf5_ETt\xdfr\xe2b\xf7)C\xb7tw"k\xf9,\xb6D\xa8\x8a~\x8cg\xddϳ\xf6\xe8\x97̶%\xccbv{0\x92\x9e\xae\xe6\xb8k\xce\xcc\xef\xe36wM\x83\xb5\x94cZ\xc0H9\xac\xa9\xfcq^\xc2֗?\xb8Ӷ\xa3{\xe9+wȐRI29x\xb8{\xea\xd6D\xb1\xa4{Ɔ\xb7\xa9\xc6,7\x8eM\x99)[\xf7\xb3./fL\xfe\xf6\x9d\xf9l\xf1Pw\xb9\xee\xf3q\xee\xfa\xe6\x8ci\xe8>g\x9bR\xa6?\x9b=\xaaNZ\x9bսY\xd3p܌\x96r\x862V6e\xdaj\x8a\xdb\xdc\xd5Z\x99\xbc+\x97PG\xd5Q-\xed[\x9e\x88\xeeY\x99\xaeNq7Ǚ\xb62\xab`\xea	\xb2+l\xf7T\xf8\xdcu\xf5\xc7M\xe7+J9\x9a?\x93q\xdfɍi\xfe\xccX\xde \x9d\xb8V\x8f]\xb9au\x9b\x9a\xa8d\xf5\xe5K\xf2\x92Ǵ\xd32Ak\x8b5%\xddxm%\xbbrLMlQ\x87\xf3^A)\xa29۾\x8cK^\x9d\xef\xc9\xea\xb4nڪ\xf8Ô\xb2n\xbaN\xceLrwH?\xa6{\xb3\x9a\x80EN\xbd\x9b\xb5}3\xcd~4\xffM˸\x8e!\xe0ES\x97\xd1]\x8f\xef\x9ft͜\xee\xf3\x83|~\xf1\xa4zܐ\xf7\xc8"\xcd\xe4\x9a\xc2a\xc3%\xcb\xfc\xd6\xe6\x87ܷ<񿨠\xb5\xf4H\xfd\x9f\xb1\xe1m\xf9\xfc\xa4n\xba\xac\xbb\xecyp\xa2\xf7\xebvқՏ\xf1\xd2Ij,\x914=\xebϪ)\x87\xed(=Sc\xf1`\x9aJR_\xf7\xf9\x91[\xa6#\xaa\xcb\xf5\xe4\xb8er\xdb/?h=%\xb96[H\x9cl\xa6}\xcbK\x8c\x88\x90D\x89\xb5rHт\xd1E\x92qǶ\xd4\xc0\xb6X\xdbP\xe2\.b˛\xcb{\xc6\xdb\xe7\xf7\xf8\x8b\x9ab8\xb6\x83J\xc2blA\xd8QJ/\xbaIlg\xcaqR\x96^K\xb7S\xaa㦴\x94\x9b14\xc3\xe5In\xfb\xa6n	\x95oy\xe3.Oz\xc1\xb0\x96\xad-QY/\xeap\xb9Oa6\xae\xaf,)\xfd\xcc\xfa\xaen{\xc7\xf5\xd5[\xf9\x9c<\x9e\xee\x91\xc2#\xb6\xbb\xb2\xbah~\xac\x8b.ڬ\xefgX~\xb3E\xbfYe5\xc2T\x9b\xcf\xed?rd\x92\x95bc\x955\xc5\xd8`υ\xbbZ\x99Y\xe6.\xf6\xd6\xe2\x87\xf591.l\xf0\xaa|Y\x95:\x93\xb5\x8dvӕly\xcb\xcdΔ\x96n\xa63\x96\x8bOp\xcf\xd3S\xfc\x80=\xe3\xa8iq\xc4|7k\xf8\xe2;\xbbny\xb1&&\xf6\xae\xd8J᧥7\xb1\xc4]ˋ\x8b\x96aڦ\xc86x\xa5\xb8\xb6e6\xfeU\xf3=\xf3^.߄\xb8˶/o\xb2L\xb8m8Iـ\xad\xcbk\x974@$\x96\xed\xbbay\xe52\xa9"Ә\x9e1\xb9\x95\xbd߷\xbc\xc1\x92\xe8% *ɯ}\xcar\xe6\xbe\xfa#\xb6e\x852\xe4N\xaa\xba\xeb\xcd\xea֡\x8co:\xb6\xa7\xa6\x83\xaf\x95\x9f\xe4͖ \x94\xb5{Ǘ\xcbg\xef\xced\xb8\x9ddjٯrJ\xdesA\x82832\xaaP\\x9e_\xfeN\xb4\x84/\xf6hLe\x81L\x9b3]9\xb1\xab\xe4b#W\xaeD^\xb7r\xb4L;_\x98*\xf7\xbc(\xda\Y$j\x91w\xecbqP\x9b\x95\xce\xca:U\xf29\x8bW\x86\x8b\xb6nƘ\xce\xfa\xa6%\xac\x86*s\xcb.5\x8f\xdb\xc9\xc3\xdc\xcb8\xb6\xc7\xd9\xf0U\xe9\xe2U\x85{\xde\xed\xb6\xee\xce\x9e\xbf\x86\x80\xe0֜\xf2]\xae\xa7\xd9\xd8U\xe4\x85\xb0=yw&T\xc6\xe5\xf7V\x9bs\xdcc^F7\xb8f\xe9\xf3\xdc\xf54\xc3q\xb9\xa6߼D囗\xa7\xb9<ez\xbe;_U\xd3Ѭl\x9a\xcf\xf1\xa3Z\xf0b6\xac&Ԅf\x99v\xf6\x9ei=\x9d\xdc<Z\xfeF\xbc\xe8n:'\xb9l\xd5]\xb9\xa4\xe7\xdc\xcdj\xef\xcay\xf3\x9e\xa1[\xd6\xdd\xff	  \xff\xff\xc9:\xf4\x94C  
2024-12-02T19:37:45.953Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=324
2024-12-02T19:37:45.953Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
